app/Controllers/Auth.php

    public function postLogin()
    {
        $username = esc($this->request->getPost('username'));
        $password = esc($this->request->getPost('password'));

        $roleFullname = [
            "PPL"=>"PPL",
            "BPP"=>"BPP",
            "KAB"=>"Dinas Kab/Kota",
            "PROV"=>"Provinsi",
        ];

        // Validate the credentials (this is just a placeholder)
        $sapaTAccountModel = model('App\Models\SapaTAccountModel');
        $account = $sapaTAccountModel->where('accUsername', $username)
                                      ->where('accPasswd', md5($password)) // Assuming passwords are stored as MD5 hashes
                                      ->first();
---
SELECT *
FROM `sapa_t_account`
WHERE `accUsername` = 'dinas_bjb'
AND `accPasswd` = '202cb962ac59075b964b07152d234b70'
 LIMIT 1