app/Controllers/Dashboard.php

SELECT *
FROM `sapa_t_usul_profil`
WHERE `proUsername` = 'dinas_bjb'
 LIMIT 1
SELECT *
FROM `sapa_r_kategori_alsintan`
SELECT *
FROM `sapa_r_kota`
SELECT *
FROM `sapa_m_instansi`
SELECT *
FROM `sapa_t_usul_poktan`
WHERE `pokUsername` = 'dinas_bjb'
AND `pokKode` NOT IN (SELECT `usulPokKode` FROM `sapa_t_usul_sarpras` WHERE `usulPokKode` IS NOT NULL)
---
    public function getUsul_sapras()
    {

        $sapaTUsulProfilModel = model('App\Models\SapaTUsulProfilModel');
        $usulProfilData = $sapaTUsulProfilModel->where('proUsername', session()->get('username'))->first();
        if (!$usulProfilData) {
            if ($this->user["role"] == "PPL" || $this->user["role"] == "KAB")
                return redirect()->to('dashboard/profil')->withInput()->with('info', 'Isi dan update profil terlebih dahulu!');
        }
        $sapaRKategoriAlsintanModel = model('App\Models\SapaRKategoriAlsintanModel');
        $kategoriAlsinList = $sapaRKategoriAlsintanModel->findAll();
        $sapaRKotaModel = model('App\Models\SapaRKotaModel');
        $kotaList = $sapaRKotaModel->findAll();
        $sapaMInstansiModel = model('App\Models\SapaMInstansiModel');
        $instansiList = $sapaMInstansiModel->findAll();

        // ambil data poktan berdasarkan username, namun jangan ambil data poktan yang pokKode-nya sudah ada di sapa_t_usul_sarpras
        $username = session()->get('username');
        $db = \Config\Database::connect();
        $builder = $db->table('sapa_t_usul_poktan');
        $builder->where('pokUsername', $username);
        $builder->whereNotIn('pokKode', function ($sub) {
            $sub->select('usulPokKode')
                ->from('sapa_t_usul_sarpras')
                ->where('usulPokKode IS NOT NULL');
        });
        $poktanList = $builder->get()->getResultArray();

SELECT `sapa_t_usul_sarpras`.*, `sapa_r_tipe_alsintan`.`tipeNama`, `sapa_r_tipe_alsintan`.`tipeKalKode`, `sapa_r_kategori_alsintan`.`kalNama`
FROM `sapa_t_usul_sarpras`
LEFT JOIN `sapa_r_tipe_alsintan` ON `sapa_t_usul_sarpras`.`usulTipeKode` = `sapa_r_tipe_alsintan`.`tipeKode`
LEFT JOIN `sapa_r_kategori_alsintan` ON `sapa_r_tipe_alsintan`.`tipeKalKode` = `sapa_r_kategori_alsintan`.`kalKode`
WHERE `sapa_t_usul_sarpras`.`usulKode` = '111'
 LIMIT 1
---
    public function postGet_sapras_by_usulkode()
    {
        $usulKode = $this->request->getPost('usulKode');
        if (!$usulKode) {
            return $this->response->setJSON(['error' => 'usulKode tidak ditemukan']);
        }
        $sapaTUsulSarprasModel = new SapaTUsulSarprasModel();
        $usulData = $sapaTUsulSarprasModel
            ->select('sapa_t_usul_sarpras.*,
        sapa_r_tipe_alsintan.tipeNama,
        sapa_r_tipe_alsintan.tipeKalKode,
        sapa_r_kategori_alsintan.kalNama')
            ->join('sapa_r_tipe_alsintan', 'sapa_t_usul_sarpras.usulTipeKode = sapa_r_tipe_alsintan.tipeKode', 'left')
            ->join('sapa_r_kategori_alsintan', 'sapa_r_tipe_alsintan.tipeKalKode = sapa_r_kategori_alsintan.kalKode', 'left')
            ->where('sapa_t_usul_sarpras.usulKode', $usulKode)
            ->first();