app/Controllers/Rekomendasi.php

    public function getIndex()
    {

        $sapaTUsulProfilModel = model('App\Models\SapaTUsulProfilModel');
        $usulProfilData = $sapaTUsulProfilModel->where('proUsername', session()->get('username'))->first();
---
SELECT *
FROM `sapa_t_usul_profil`
WHERE `proUsername` = 'ppl_new'
 LIMIT 1